In [1]:
import pandas as pd

data = [2,15,28,30,75]
s = pd.Series(data, index=['p', 'q', 'r', 's','t'])
print(s)

p     2
q    15
r    28
s    30
t    75
dtype: int64

In [ ]:
import pandas as pd  

data = {
    'Name': ['Shakib', 'Sohan', 'Rasel', 'Milon'],
    'Age': [16, 21, 26, 24],
    'City': ['Dhaka', 'Rajshahi', 'Chandpur', 'Panchagarh']
}

df = pd.DataFrame(data)
print(df)

     Name  Age        City
0  Shakib   23       Dhaka
1   Sohan   21    Rajshahi
2   Rasel   26    Chandpur
3   Milon   24  Panchagarh

In [1]:
column = df['Age']
print(column)

NameError: name 'df' is not defined

In [5]:
row = df.loc[1]  
print(row)

Name       Sohan
Age           21
City    Rajshahi
Name: 1, dtype: object

In [7]:
subset = df.loc[1:3, ['Name', 'City']]  
print(subset)

    Name        City
1  Sohan    Rajshahi
2  Rasel    Chandpur
3  Milon  Panchagarh

In [8]:
df.isnull()

    Name    Age   City
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [9]:
df.fillna(0, inplace=True)
df

     Name  Age        City
0  Shakib   23       Dhaka
1   Sohan   21    Rajshahi
2   Rasel   26    Chandpur
3   Milon   24  Panchagarh

In [10]:
df.dropna(inplace=True)

In [11]:
grouped = df.groupby('City').agg({'Age': ['mean']})
print(grouped)

             Age
            mean
City
Chandpur    26.0
Dhaka       23.0
Panchagarh  24.0
Rajshahi    21.0

In [12]:
grouped = df.groupby('City').agg({'Age': ['mean', 'min', 'max']})
print(grouped)

             Age
            mean min max
City
Chandpur    26.0  26  26
Dhaka       23.0  23  23
Panchagarh  24.0  24  24
Rajshahi    21.0  21  21